status/2020/24oct20.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>18 October 2020 - 24 October 2020</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">18 October 2020 - 24 October 2020</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org463b028">1. Live Oak Weather Station</a>
<ul>
<li><a href="#org675422c">1.1. Beaglebone green wireless configured</a></li>
<li><a href="#org259dc9b">1.2. BBG SD Boot</a></li>
<li><a href="#org9dbdf64">1.3. I2C bus configured</a></li>
<li><a href="#org254f863">1.4. Sensor shelter</a></li>
</ul>
</li>
<li><a href="#org105a6f5">2. Math puzzle</a></li>
<li><a href="#orgf9f0ef9">3. Inmate search</a></li>
</ul>
</div>
</div>

<div id="outline-container-org463b028" class="outline-2">
<h2 id="org463b028"><span class="section-number-2">1.</span> Live Oak Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
Raspberry PI zero W was turning into a pain - I really didn't want to
deal with writing a SPI slave driver (there's a pun in there somewhere).
</p>

<p>
Instead, I'll just do something similar to the SJ station, which uses
a Beaglebone Black and a Argent WS-1. Here I'll use a Beaglebone Green
Wireless and an Argent WS-1, plus interfaces for the PM, UV, and
BME680 gas sensor.
</p>
</div>

<div id="outline-container-org675422c" class="outline-3">
<h3 id="org675422c"><span class="section-number-3">1.1.</span> Beaglebone green wireless configured</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The challenge here was working out which of the at least four different
ways to configure 802.11 for the Beaglebone was the one to actually use.
"connman" seemed to do the trick.
</p>
</div>
</div>

<div id="outline-container-org259dc9b" class="outline-3">
<h3 id="org259dc9b"><span class="section-number-3">1.2.</span> BBG SD Boot</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Wiring up the "user" button to be permanently pressed seems to be
reliable - there was conflicting information whether just booting once
off of SD somehow makes the boot configuration permanent.
</p>

<p>
There was some evidence that the power button needed to be pressed
after a powered shutdown but I haven't been able to reproduce the
problem.
</p>
</div>
</div>

<div id="outline-container-org9dbdf64" class="outline-3">
<h3 id="org9dbdf64"><span class="section-number-3">1.3.</span> I2C bus configured</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Fun with device tree overlays.
</p>
</div>
</div>

<div id="outline-container-org254f863" class="outline-3">
<h3 id="org254f863"><span class="section-number-3">1.4.</span> Sensor shelter</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Three sections printed. May need one more section.
</p>
</div>
</div>
</div>

<div id="outline-container-org105a6f5" class="outline-2">
<h2 id="org105a6f5"><span class="section-number-2">2.</span> Math puzzle</h2>
<div class="outline-text-2" id="text-2">
<p>
Spent <b>way</b> more time solving a math puzzle - first puzzle from:
</p>

<p>
<a href="https://www.quantamagazine.org/three-math-puzzles-inspired-by-john-horton-conway-20201015/">https://www.quantamagazine.org/three-math-puzzles-inspired-by-john-horton-conway-20201015/</a>
</p>

<p>
Started to solve by hand using a "tree search", but failed to find the
solution. I then solved it programatically, and then generated a
search graph in 'dot'.
</p>

<p>
<a href="https://daniel-kelley.github.io/misc/3816547290.html">https://daniel-kelley.github.io/misc/3816547290.html</a>
</p>
</div>
</div>

<div id="outline-container-orgf9f0ef9" class="outline-2">
<h2 id="orgf9f0ef9"><span class="section-number-2">3.</span> Inmate search</h2>
<div class="outline-text-2" id="text-3">
<p>
Just in case someone needs to know:
</p>

<p>
<a href="https://www2.illinois.gov/idoc/Offender/Pages/InmateSearch.aspx">https://www2.illinois.gov/idoc/Offender/Pages/InmateSearch.aspx</a>
</p>

<p>
<a href="https://www.bop.gov/inmateloc/">https://www.bop.gov/inmateloc/</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:04</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
